---
kind: method
id: M:Autodesk.Revit.DB.FaceSilhouetteNode.GetFace
source: html/40f9102d-739c-6eb6-17fe-6057d07916e0.htm
---
# Autodesk.Revit.DB.FaceSilhouetteNode.GetFace Method

Returns the Face object corresponding to the node.

## Syntax (C#)
```csharp
public Face GetFace()
```

## Returns
The face.